Repository: mozilla-l10n/mt-training-data
Catalog: trw/trw_pontoon.tmx
Source language: en_us
Languages: trw

source: Some languages have enormous variation in grammar, vocabulary and pronunciation. For this reason, we are <ctaLink>introducing ‘Variants’</ctaLink> in 2022. This gives communities a way to distinguish their languages within the larger dataset.
trw: یام جیِبا سی گرائمر می، ٹیِگلا می آں بنُو سی انداز می چیر گن فرق ہویی۔ اے وجہ سی کیا مھو مختلف فرقا سی معلوم کؤ سی 2022 می <catLink> پشادی۔ ایندے خلگا یے جیِبا سی گھن ڈیٹا سیٹ می تُنُو جیِب سی پیانُو سُوگھا ہودُو۔

source: Someone asks for a language to be added.
trw: یی تُنُو جیِب یا کی جیِب سی جم کؤ سی توص کی۔

source: Something went wrong while fetching audio for transcriptions. Please try again later.
trw: آڈیو ٹرانسکریِٹ کؤ سی کیا آنُو می کآں غلطی ہی۔ دُوآر کوشش کو۔

source: Something went wrong while fetching prompts. Please try again later.
trw: پرامپٹ سی آنُو می کآں غلطی ہی۔ دُوآر کوشش کو۔

source: Something went wrong while fetching transcriptions. Please try again later.
trw: ٹرانسکریِٹ سی آنُو می کآں غلطی ہی۔ دُوآر کوشش کو۔

source: Something went wrong with reCAPTCHA. Please try again.
trw: اے شکل سی پیانُو می کآں غلطی ہی۔ دُوآر کوشش کو۔

source: Some variants and dialects within a language or language family are very different from each other. If you’re having trouble engaging around a particular variant, you can change your preferences here.
trw: اے جیِب سی آندے یام لہجہ یا قسم ایک دیئی ما چیر دھأل ہودی۔ کو تھو یے اے خاص قسم سی پیانُو مسلہ تُھوا تُو تںُو خوش مھید بدل کوبھادُو۔

source: Soninke
trw: سونیکی

source: Sorbian, Lower
trw: سوربیان

source: Sorbian, Upper
trw: سوربیان، بھیِم

source: Sorry, Common Voice is running slowly. Thanks for your interest.
trw: اوہ، کامن وائس دما دما سیت کام کودُو۔ چھی ای می کام لرُو سی کیا شکریہ۔

source: Sorry, something went wrong
trw: معافی، کآں شیشی غلط فا

source: Source: { $sentenceSource }
trw: بآن { $sentenceSource }

source: Southern Kurdish
trw: جنوبی کُردی

source: Southern Sotho
trw: جنوبی سوتھو

source: Southwestern Tlaxiaco Mixtec
trw: جنوب مغربی ٹلیکسکو میکسٹیک

source: Spanish
trw: سپینی

source: Speak
trw: بنا

source: Speakable
trw: جملا بنا بییَن

source: Speakers
trw: بناڑ

source: Speaking
trw: بنُو

source: Speaking and Listening
trw: بنُو او بُھویُو

source: Speak in your normal voice! The way you speak is welcome here - we want your accent as it is, and we want your usual volume, style and intonation.
trw: تُنُو عام آواز می بن۔ کامے طریقہ دے تُو بندُودو غورا تُھو۔ مھو یے چھی آواز سی وا بھا کھأکأ تھیدا ہامُوڑ پکار تھی۔ آں مھویے چھی آواز سی عام زورا یا آسُودا پکار تُھو آن کامک چھی بنُو سی یا زور دیؤ سی سٹائل چھیدا سے پکار چھی۔

source: Speak now
trw: بنا مھیرے

source: Speak options menu
trw: بنُو سی آپشنا سی مینُو

source: Speak up, contribute here!
trw: بنا بأ۔ مھید کے تھلا بأ!

source: Special Characters and Foreign Letters
trw: خاص کیریکٹرز آں دأل جیِبا سی حروف

source: Special symbols and punctuation should only be included when absolutely necessary. For example, an apostrophe is included in English words like “don’t” and “we’re” and should be included in the source text, but it’s unlikely you’ll ever need a special symbol like “@” or “#.”
trw: رموز آن خاص شکل صرف تھلا تھلُو پکار تُھو کے یأ ہے چیر ضروری ہُوئیو۔ مثادے جملہ می یأ مھأ انگلش ٹیگلا می ایپاسڑاپھی پکار تھی خو خاص کیریکٹر یأمے @$% تھلُو دے مسلہ ہودی۔

source: <speechBlogLink>Get Started with Speech Recognition</speechBlogLink>
trw: <speechBlogLink> سپچج پیانُو سی مشین می شروع ہوا۔

source: Spelling and Punctuation
trw: املا او رموز

source: Split into { $archiveCount } ZIP files containing
trw: جُدا ہُوئل { $archiveCount } زیِپ فایل می تھی

source: Splits
trw: حصّہ

source: Splits (Age and Sex)
trw: اُومو او جنس می تقسیم

source: Spontaneous Speech
trw: مُوا بأت

source: Start recording
trw: ریکارڈنگ شروع کو

source: Start typing to describe your accent
trw: مھید تُنُو جیِب سی لہجہ سی بارا می لیِکھ

source: Stats
trw: لیکھ میکھ

source: Status Page
trw: سٹیٹس سی پاݜ

source: Still have questions?
trw: بھی کی سُوال تُھو؟

source: Streaks
trw: مقصدا سی چیڙ

source: <strong>[Crackle]</strong> giant dinosaurs of <strong>[crackle]</strong> -riassic.
trw: <strong>[کڑسأ]</strong> گھن ڈائنو سارس <strong>[کڑسأ</strong>] ریساسیک۔

source: <strong>Do not reject clips where the speaker ‘has an accent’ that is different to your own</strong> - this is important for voice recognition to work better for everyone.
trw: <strong> تھأ کلپ رد نہ کو کھید یأ بناڑ سی بنُو می مھال وا او بھا آواز ہودیدا سے تھأ ما بدل تھی۔ </strong>۔ آواز سی پیانُو سی کیا اہم بات چھی یرأ بُوڑا آواز پیانا بیے۔

source: <strong>Get creative!</strong> Your language community will be unique, and these are just a few ways to get started.
trw: <strong> تخلیقی خلگ پا</strong>۔ چھی جیِب سی خلگے بدل ہونیِن آں أ صرف دھأک شیئی آشی مے کام شروع کؤ سی کیا۔

source: <strong>[Sneeze]</strong> The giant dinosaurs of the <strong>[cough]</strong> Triassic.
trw: <strong> ٹھیِں </strong>گھن ڈائنوسارس <strong>کھأنگ</strong> ٹریاسیک۔

source: Submit
trw: تھلا

source: Submit All
trw: بُوڑ تھلا

source: Submit a new question for the community to read and respond to
trw: کمیونیٹی سی کیا اے نم سوال تھلا یرأ سے تیس پرھاؤ کوئن آں جواب دئن

source: Submit a report
trw: رپورٹ تھلا

source: Submit clips
trw: کلپ تھلا

source: Submit new questions for the community to read and respond to
trw: کمیونیٹی سی کیا نم سوال پڑھاؤ کؤ سی آں جواب دیؤ سی کیا تھلا

source: Submitted
trw: تھلا گا

source: Subscribe
trw: می سیت آمن میلاؤ کو/سبسکرائب

source: Success
trw: کامیابی

source: success checkmark
trw: کامأبی چیک کو

source: Success, profile created!
trw: کامیاب۔ پروفائل سوا گأ!

source: Support open, community-led datasets
trw: ہر ایک سی کیا پدا کمیوںیٹی سی ڈھأرا ڈیٹا سیٹ سی مدد کوا

source: Swahili
trw: سُوہلیی

source: Swedish
trw: سُویڈیشی

source: Swipe right to approve the sentence. Swipe left to reject it. Swipe up to skip it. <strong>Do not forget to submit your review!</strong>
trw: جملہ منظورؤ سی کی سوَن دیژ کے ڙھان دے۔ ہین رد کؤ سی آوین دیِش کے ڙھان دے۔ ای ما نُوخو سی کیا بھا یے ڙھان دے۔ <strong>۔ تُنُو جائزہ مھید کے تھلُو نہ آمُوݜ۔ </strong>

source: Syriac
trw: سریئک

source: Tagalog
trw: ٹوگولاگ

source: Tahitian
trw: تاھیتی

source: Taiwanese (Minnan)
trw: تائوانی (مینن)

source: Tajik
trw: تاجک

source: Taking several attempts to read a word.
trw: کامے اے ٹیگیل سی بنُو سی کیا چیر گونے کوشش کؤ۔

source: Tamazight
trw: ٹامازیگٹ

source: Tamil
trw: تامل

source: Tap
trw: پھرگا

source: Tarifit
trw: ٹاریفٹ

source: Tatar
trw: تاتار

source: Tatoeba is a large database of sentences, translations, and spoken audio for use in language learning. This download contains spoken English recorded by their community.
trw: ٹاٹوئبا جیِب سی ڇھیِڙُو سی کیا آڈیو، جملا آں ترجمہ سی کیا ایک ݜواد تُھو۔ ای می بنیل انگلش سی مواد تھی۔

source: Technology and Robotics
trw: ٹینکالوجی او روباٹ

source: Technology that speaks your language
trw: ٹیکنالوجی کامک یأ چھی جیِب بنہ یی

source: TED-LIUM Corpus
trw: ٹی ای ڈی - ایل ائی یو ایم سی مواد

source: Teke
trw: ٹیکے

source: Tell us what you'd like to download:
trw: مھو یے بنا تھو کا ڈاؤنلوڈ کؤ نیِمادی:

source: Telugu
trw: تیلگو

source: Terms
trw: ٹیگیل

source: <termsLink>Terms</termsLink>
trw: <termsLink> شرایط </termsLink>

source: Thai
trw: تھائی

source: Thanks for confirming your account, now let's build your profile.
trw: تُنو ایکاؤنٹ سی تصدیق کؤ سی کیا شکریہ۔ مھیرے یا مھو پروفائل سوئیی

source: Thanks to contributions from over 259k people in over 50 languages, this data is being used to train speech-enabled applications to better respond to the human voice.
trw: دش او دُوبیِش جیِبا می دُونیئ ما دُو لکھ ڇابیِش خلگا سیت کام کؤ سی کیا مہربانی۔ أ ڈیٹا انسانا سی کیا مشین سی اپلیکیشن سی تربیت کؤ سیا کیا استعمال ہودُو۔

source: Thank you for contributing to Spontaneous Speech!
trw: سیدھا سیدھا تُنو آواز تھلُو سی کیا شکریہ

source: Thank you for contributing your bulk submission!
trw: تُنُو پھونڈوکے جملا سی تھلُو سی کیا مھو چھی شکر گزار تھی!

source: Thank you for contributing your voice!
trw: تُنو آواز مھو یے دیؤ سی کیا شکریہ!

source: Thank you for donating your voice clips!
trw: تُنو آواز مھو یے دیؤ سی کیا مھو چیر مہربأنگی کودی!

source: Thank you for recording!<lineBreak></lineBreak>Now review and submit your clips below.
trw: ریکارڈ کؤ سی کیا چھی مہربأنگی </lineBreak>۔ مھیرے بھی بُو آں تُنو کلپ ٹین گے تھل۔

source: Thank you for your information
trw: معلومات دیؤ سی کیا تُھن شکریہ

source: Thank you for your interest in contributing to { $lang }. We work hard to get every language ready for launch and keep the teams updated via email. If you want to contribute, please provide your email below.
trw: مھید کے دیؤ سی چھی دلچسپی سی کیا چھی شکریہ { $lang }۔ مھو ہر جیِب سی مھید شائع کؤ سی کیا گن کام کودی آں کم والا ای میل سی ذریعہ دے شیِدادی۔ کوتُو ہُم کی کام مھید کؤ نیِمادُو تُنو ای میل مھید مھو یے دے۔

source: Thank you for your voice information
trw: تُنو آواز سی دیؤ سی کیا مھو چھی شکریہ کودی

source: Thank you! You’ve sent a new language enquiry
trw: چھی شکریہ! تأ اے نیم جیِب سی بارا می سُوال چھؤ

source: The best sentences are natural and conversational — they should be easy for someone to read. While phonetic diversity and different words in sentences is important, we are also trying to make recording sentences as engaging and fun for our volunteer community as possible.
trw: غورا جملہ قدرتی آن بأت بأدا سی ہودی۔ ہے ہر ماݜ سی بنُو سی کیا سُوگھا ہودی۔ جملا می خلگا سی آوازا سی فرق ہودی آں چیر اہم ہودی مھو کوشش کودی یرأ ریکارڈ کویل جملہ ہر ایک سی خوش سی ہوئین آں جیِب سی خلگ تھیے ما مزا گھینن۔

source: The best sentences for building a useful speech recognition engine are colloquial, modern parlance. Some ideas to help you generate sentences are;
trw: مشین سی کیا پیانُو سی کیا غورا جملہ عام جدید طرز می ہُوئین۔ تُھن کیا صحیح جملا سی کؤ سی کیا دھأک سلا أ تھی:

source: The bumblebee sped by.
trw: بھیِمیݜ دھأئں دیِد۔

source: The Clip Graveyard consists of voice clips that didn't make it into the Common Voice dataset. Just like the dataset, the Clip Graveyard is available for download. We would like to thank the following people and organizations for their help with the project:
trw: کلپا سی گورستان می سے کلپس ہودی کامے یأمنے کامن وائس سی ڈیٹا سیٹ کے تھلا نہ گئدیدا۔ بلکل ڈیٹا سیٹ سئ چھلے کلپا سی گورستان ہُم ڈاؤن لوڈ کؤ سی کیا ہودُو۔ مھو وایے دیل خلگ آں تنظیما سی شکریہ کودی کامے یأمنے مے منصوبہ مُھن مدد کی یی دا۔

source: The clip has disrespectful or offensive language.
trw: مے کلپ می بے باکا یا بے ادبا جیِب چھی۔

source: The Common Voice Dataset contains hundreds of thousands of voice samples that help developers build voice recognition tools.
trw: کامن وائس ڈیٹا سیٹ می لکھأ کلپا سی نمونا تھی تھأ خلگے آوازا سی پیانُو سی سیوأدتی۔

source: The community is the beating heart of Common Voice - they come from all over the world, and are language activists and scientists and artists. You can learn more about how to get involved on our <about>About</about> page and in our <community>Community playbook</community>. If you're interested in deeper organisational partnership, <emailFragment>get in touch.</emailFragment>
trw: کمیونیٹی کامن وائس سی جن پھراگاڑ حی تُھو۔ ہے بُوڑ دُونیئ می تھی آں جیِبا سی کارکن تھی، سائنسدان آں فنکار تھی۔ تھو مُھن بارا می آں مھو سیت شریک ہؤ سی بارا می مُھن پاݜ مُھن بارا <about> مُھن کمیونیٹی پلے بک <community> زید آمن جنا بھادی۔ کو تھو تنظیمی لحاظ تے مھو سیت شیریک ہوؤ می دلچسپی گھینَدیو مھو یے مھید ای میل </emailFragment> کوا۔

source: The content contains a language different than I was expecting.
trw: ای می کامے جیِب یأ آ بودودا تی ما دئی کا جیِب چھی

source: The content has disrespectful or offensive language.
trw: جملہ لأݜ چھی یا بے ادبا چھی۔

source: The giant dino [cough] the Triassic.
trw: گھن ڈائنا [کھأنگ] ٹریاسیک۔

source: The giant dinosaur of the Triassic.
trw: ٹریاسیک سی گھن وجود سی ڈائنوسار۔

source: The giant dinosaurs of the Triassi-.
trw: ٹریاسیک سی گھن وجود سی ڈائنوسار۔

source: The giant dinosaurs of the Triassic.
trw: ٹیریاسیک سی گھن وجد سی ڈائنوسار۔

source: The giant dinosaurs of the Triassic. [read by one voice]
trw: ٹریاسیک سی گھن ڈائنا سار [اے آواز ایس بنُو]

source: The giant dinosaurs of the Triassic. <strong>[read by one voice]</strong>
trw: تے ٹریاسسیک سی گھن ڈائنوسارس<strong> اے آواز تے بنا گا</strong>

source: The giant dinosaurs of the Triassic. Yes.
trw: تے ٹریاسیک سی سے ڈائنوسارس۔ ٹیک

source: The giant dino <strong>[cough]</strong> the Triassic.
trw: گھن ڈائنو<strong>[کھأنگ]</strong> ٹریاسیک۔

source: The MediaRecorder API is not supported in your browser.
trw: چھی براؤزر می میڈیا ریکارڈر اے پی آئی کام نہ کودُو۔

source: The number of recordings and which languages you contribute to will be public.
trw: چھی ریکارڈنگ آں کامے جیِب می تُو ریکارڈ کودُو صرف ای پبلک ہونیِن۔

source: The page you are looking for could not be found
trw: کامے پاݜ تُھو بودے دا تیس مھو یے نہ پاد

source: There are currently no prompts for this language. Please refresh the page or try again later.
trw: مھیرے کی آڈیو سی لیِکھ نی چھی مے جیِب سی۔ مے پاݜ دوبارا تازہ کوا آں بھی کوشش کوا۔

source: There are currently no sentences to review in this language.
trw: مے جیِب می مھیرے کی جملہ لا بھی بُو سی کیا نی تھی۔

source: There are currently no transcriptions to check for this language. Please refresh the page or try again later.
trw: مھیرے کی آڈیو سی لیِکھ نی چھی مے جیِب سی۔ مے پاݜ دوبارا تازہ کوا آں بھی کوشش کوا۔

source: There are lots of ways to think about language. For the purposes of speech recognition models, Common Voice suggests focussing on ‘mutual intelligibility’, or ‘can speakers of this language mostly understand one another if they try to?’
trw: جیِب سی بارا سی فکر کؤ سی کیا چیر پن تھی۔ بنُو سی پیانُو سی کیا ماڈل سی کیا کامن وائس کامن وائس ایک دیئی سی جنُو یا دأال بنأڑا سیت بنُومی ایک ایئی ما جنَدسی کو نأ؟

source: The recording was too long.
trw: ریکارڈنگ چیر ڙیگ چھی۔

source: The recording was too quiet.
trw: ریکارڈنگ سی آواز چیر کم تُھو۔

source: The recording was too short.
trw: ریکارڈنگ چیر کھیڑین چھی۔

source: There is currently no audio to transcribe for this language. Please refresh the page or try again later.
trw: مے جیِب می مھیرے کی آڈیو نُو تُھو یرأ تیس لیِگادا۔ مہربانی کیدے مے پاݜ تازا کو یا بھی کوشش کو

source: There should ideally be no digits in the source text because they can cause problems when read aloud. The way a number is read depends on context and might introduce confusion in the dataset. For example, the number “2409” could be accurately read as both “twenty-four zero nine” and “two thousand four hundred nine”.
trw: مواد می غورا تُھو یرأ کی ہندسا نہ ہوئین کئی کے سے بنُو می مسلہ سوادی۔ عدد سی بنُو ہر پوت می گیر چاپیر ٹیگلا زید ہودُو آں ایندے متاثر ہودُو آں اے وجہ دے جنُو می مسلہ پیدا کودُو۔ مثلاً عدد 2409 کے چوبیس سو نو ہُم بنَدی یا چوبیس صفر نو ہمُ بندی یا دُو زر چؤ او بیِش ہُم بندی۔

source: There will be natural variations in volume between readers. Reject only if the volume is so high that the recording breaks up, or (more commonly) if it is so low that you can’t hear what is being said without reference to the written text.
trw: مختلف بناڑ سی آواز سی بھا یا وا ہؤ قدرتی ہُم ہودُو۔ کو آواز مھدیک بھا ہُو یرأ تین دے سے ریکارڈنگ پھورئیو تھلا رد کوا۔ یا کو چیر گن دما سیت ہُوو یرأ کا بنُودپودا تیس تُو نُو بُھوش بھادُوو بھی ہُم اے ریکارڈنگ چھوا۔

source: The route was unclear.
trw: جملا سی پان صاف نی چھی۔

source: These languages are currently under community development. <localizationGlossaryLink>Website localization</localizationGlossaryLink> and <sentenceCollectionGlossaryLink>sentence collection</sentenceCollectionGlossaryLink> is needed to launch.
trw: أ جیِب مھیرے کمیونیٹی سئ دیِشا مے پوت زید تھلا بیَدی۔ <localizationGlossaryLink> ترجمہ سی ویب سائٹ </localizationGlossaryLink> آں <sentenceCollectionGlossaryLink> جملا سی جم کؤ </sentenceCollectionGlossaryLink> می سی چیر ضروری تُھو۔

source: The selected file is too large
trw: کاریل فائل چیر گھین چھی

source: The Sentence Collector is moving to the core Common Voice platform. You can now <writeURL>write</writeURL> a sentence or <reviewURL>review</reviewURL> single sentence submissions on Common Voice.
trw: جملا سی سرڑُو سی مشین کامن وائس سی مُوئمو یے بیَدُو۔ تُو مھیرے <writeURL> اے جملہ <reviewURL>یا ریوو می اے جملہ کامن وائس زید لیِکھ بھادُو۔

source: The sentence has a grammatical or spelling error.
trw: جملہ می گرائمر سی یا لیِگُو سی غلطی چھی۔

source: The sentence has disrespectful or offensive language.
trw: جملہ لأݜ چھی یا بے ادبا چھی۔

source: The sentence must be grammatically correct.
trw: جملا گرائمر سی جوڑ تے خامخا ٹھیک ہُوئن۔

source: The sentence must be speakable.
trw: جملا بنُو سی قابل ہُوئن۔

source: The sentence must be spelled correctly.
trw: جملا سی ٹیگیل آں ہیجا خامخا ٹھیک ہُوئین۔

source: The sentence should have fewer than 15 words.
trw: جملہ می 15 ما کم ٹیگیل/الفاظ ہوئین۔

source: The site is ready to be launched when it reaches 75% completion.
trw: أ سائئٹ شائع کؤ سی کیا تیا تھلا ہویی کے یأ ہے 75 فی صد تیا ہیو۔

source: The site will be back up as soon as possible. For the latest information, please join the <matrixLink>Matrix community chat</matrixLink> or visit <githubLink>GitHub</githubLink> or <discourseLink>our Discourse forums</discourseLink> to submit and monitor site experience issues.
trw: مے سایٹ سی بیک آپ سوا بشنیِن چیر شیرتے۔ نم معوماتا سی کیا مُھن میٹرکس می مھید <matrixLink>شامل ہوا یا کمیونیٹی سیت سلا سی کیا </matrixLink>مھید کے یا یا بھی گٹ ہب مھید </githubLink>بُوا آں مھید تھو <discourseLink>سلا مشورہ سی مے ڈسکورس فورم می </discourseLink> شامل ہوبھادی آں مھأ مسلا زید بات کوبھادی۔

source: The TED-LIUM corpus was made from audio talks and their transcriptions available on the TED website.
trw: ٹی وی ڈی -ایل ائی یو ایم سی مواد ٹیڈ سی ویب سائٹ زید آڈیو لیکچر آں تھیِن ٹیکسٹ تُھو۔

source: The website text is translated into that language.
trw: ویب سائسٹ سی مواد تے جیِب می ترجمہ کؤ۔

source: This content contains personally identifiable information related to an individual's identity, such as their name, email address, location, identification number, or phone number.
trw: مے مواد می کیِئی سی بارا می زاتی معلومات تھی تیندے سے پیانا بیَدی مثلاً نام، ای میل، پوت فون نمبر یا شناختی نمبر۔

source: This information is optional to provide - you should only add it if you feel comfortable. When we release the dataset, we pseudonymise all personal information, and make sure information like your name and email are not connected to demographic information like age or sex.
trw: مھأ معلوماتا سی دیؤ اختیاری تُھو۔ تُو تھلا مھید جمع کو کے یأ تھے یے غورا معلوم ہُوو۔ کے یأ مھو مے ڈیٹا سیٹ شائع کؤسأدو مھو یے چھی ٹیک نام سی معلومات نہ دے نیِن آں میس یقینی کونیِن یرأ چھی نام، ای میل، چھی برادری سی آں چھی اُومُو او جنس سی بارا می پتہ نہ گھڑے۔

source: This information is optional to provide - you should only add it if you feel comfortable. When we release the dataset, we pseudonymise all personal information, and make sure information like your name and email are not connected to demographic information like age or sex. For technology to work well for everyone, the data that helps developers to build technology needs to reflect a diverse range of people. Learn more about why metadata matters.
trw: مے معلومات سی دیؤ لازمی نُو تُھو۔ تھو تھلا دے بھادی کے یأ تھے یے غورا معلوم ہُو۔ کے یأ مھو ڈیٹا سیٹ شائع کؤسأدو مھو ہر ایک سی زاتی معلومات گمنام کودُو اند میسی خیال کودُو یرأ یی سی آبادی سی، اُومُو سی، جنس یا صنف سی معلومات نے دیدی۔ ہر ایک سی کیا ٹیکنالوجی سی سہی کم سی کؤ سی کیا کام یأمنے مے ڈیٹا سیٹ استعمال کودیدا سے ای زید تُنو خیال دئین۔ معلوماتا سیت مزید معلوماتا سی بارا می جنا یرأ ہے کئی اہم تُھو۔

source: This is a use case driven segment containing data to power spoken digit recognition and yes / no detection.
trw: أ ہندسائے دے بأدا سی پیانُو سی ہاں او نأ پؤ سی شیئی تُھو۔

source: This is how you cite yourself if you wrote the content yourself.
trw: کو تأ لیگُودُو تُو مے طریقا دے تُنُو حوالہ دے بھادُو۔

source: This project would not be possible without people like you. 🎉 There are many ways to get involved with Common Voice - you don't have to know how to code to contribute!
trw: می منصوبا چھی خلگے ما بغیر سرا ممکن نہ ہونیِندے۔ شاباش! کامن وائس سیت کم سی کؤ سی چیر پن تھی۔ تھیے ضروری نُو تُھو کے کھأکأ ایسی اصول دے کام کونیِن!

source: This setting controls your leaderboard visibility. When hidden, your progress will be private. This means your image, user name and progress will not appear on the leaderboard. Note that leaderboard refresh takes ~{ $minutes }min to populate changes.
trw: اے سیٹنگ چھی کم سی بُو سی پشؤ برابر کوئے۔ کو بیِریڈ ہیِو چھی کم سی تیریقی پرائیویٹ ہویی۔ ای سی مطلب ہی یرأ چھی نام، چھی نام سی پیانُو آں چھی کم سی تیریقی چھی مے بورڈ زید پشا نہ بشنیِن۔ بُو ہے بورڈ مھیدیک { $minutes } ملٹ دُوآر چلُو می آن بدلی ایتکے میتکے کؤ می گھینَدُو۔

source: Three to go!
trw: ڇا پوڑی مُوٹھأئے دأل تھی!

source: Tibetan
trw: تیبتی

source: Tigre
trw: ٹایگیر

source: Tigrinya
trw: ٹیگرینیا

source: To change or edit your email, send us an email to <emailFragment>commonvoice@mozilla.com</emailFragment>
trw: تُنو ای میل ایڈیت کؤ سی کیا یا بدل کؤ سی کیا مھو یے مھید commonvoice@mozilla.com ای میل پے۔

source: Today
trw: آش

source: Today's Common Voice progress on clips recorded
trw: ریکارڈ کوئل کلپا سی آش کامن وائس زید تیریقی

source: Today's Common Voice progress on clips validated
trw: تصدیق کوئیل کلپا زید آش کامن وائس سی تیریقی

source: Today's Progress
trw: آش سی کام

source: Toki Pona
trw: ٹوکی پونا

source: To make it into the Common Voice dataset, a voice clip must be validated by two separate users.
trw: کامن ڈیٹا سیٹ می اے کلپ سی تھلُو سی کیا پکار تُھو یرأ ایسی دُو جنے تصدیق کی۔

source: Too many files
trw: چیر گن فائلز اے پوت تھی

source: Top Contributors
trw: بُوڑے ما بھا کام کؤ والا

source: Total
trw: بُوڑ

source: Total Approved
trw: ٹول منیل کلپ

source: To the right we outline the benefits and clarify what information we make public. Use the links below to get started with a Common Voice account on your own device.
trw: سوَن دیِش کے مھو فائدا سی بارا می دیدی آں میس ہُم بندّی یرأ مھو کا پبلک کودی۔ ٹین گے دیل لنکس استعمال کو کامن وائس سی ایکاؤنٹ کھاتا سوؤ سی کیا۔

source: Toward next goal
trw: مُوٹھائے بیُو

source: Track progress here and on your stats page.
trw: مے شمار سی مُو زید تُنو کم سی آندازہ گھیِنا

source: Transcribe
trw: آڈیو لیِگا

source: Transcribe answers
trw: سوال آڈیو ما لیِگا

source: Transcribe Audio
trw: آڈیو لیِگا

source: Transcribe audio recordings into text
trw: آڈیو ریکارڈنگ خط می لیِگا

source: Transcribe audio recordings in your language
trw: تُنو جیِب می ریکارڈ کوئیل آڈیو لیِگا

source: Transcribe Audio <small>(Coming soon)</small>
trw: آڈیو لیِگُو <small> شیرتے ینیِن

source: Transcript edited successfully
trw: ٹرانسکریپٹ کامأبی دے ایڈیٹ کوا گأ

source: Transcript skipped successfully
trw: ٹرانسکریپٹ پتکت کامأبی دے چھوا گأ

source: Transcript submitted successfully
trw: ٹرانسکریپٹ کامأبی دے تھلا گأ

source: Transcript voted successfully
trw: ٹرانسکریپٹ کامأبی دے پیا گا

source: Transgender
trw: ٹرانسجینڈر

source: <translateVideoLink>Watch our guide on how to use Pontoon.</translateVideoLink>
trw: <translateVideoLink> مھید مُھن گائڈ بپوا پونٹون سی استعمال سی کیا۔ </translateVideoLink>

source: Translating the site
trw: ویست سائسٹ ترجمہ کؤ

source: Translation is from English, but you can see <strong>Suggestions</strong> in other languages. Click the <strong>Profile</strong> icon, then <strong>Settings</strong> link and add any languages you speak. At the bottom right-hand corner will be a list of translations called <strong>Locales</strong>. Translations show on the site after one day.
trw: ترجمہ أنگریزی ما چھی خو تُو <strong> دأل جیِبا سی بارا می ہُم تجاویز پا بھادُو۔ کلک کو مے خاکہ <strong>زید ۔ بھی سیٹنگ گے بش </strong> آں کامے جیِب یأ تُو بنَدُو تیس شامل کو۔ ٹوپ می سون دیِش کے گُوٹ می ترجما سی اے لسٹ <strong>ہونیِن تینس کے ترجمہٕ/لوکلز بندی۔ سائسٹ زید ترجمہ اے دی ما بعد پشا بیی۔
